a = [True, 100, 10.5, 'Foo']
print(a)  # [True, 100, 10.5, 'Foo']
print(a[3])  # Foo
print(a[-1])  # Foo
# К спискам можно обращаться как к срезам.
print(a[1:3])

# a[1:2] = 200  # Ошибка! Так присваивать нельзя!
a[1:2] = [200]  # А так можно!
print(a)  # [True, 200, 10.5, 'Foo']
a[1:3] = [2, 3, 4]  # И так можно!
print(a)  # [True, 2, 3, 4, 'Foo']

print(f'Длина списка a: {len(a)} элементов')

# Многомерные списки:
b = [1, ['a', 'b'], 3]
print(b)  # [1, ['a', 'b'], 3]
print(b[1][0])  # a

b.append(True)  # Доступно множество методов.
print(b)  # [1, ['a', 'b'], 3, True]

# Сделать независимую копию.
# Что-то типа substring(0, len(str))
c = b[:]
c = []  # Затереть пустым списком.
print(c)  # []
print(b)  # [1, ['a', 'b'], 3, True]
